# –ë–æ–ª—å—à–æ–π –≥–∞–π–¥ –ø–æ –Ω–∞—Å—Ç—Ä–æ–π–∫–µ Cisco IOS (C3745 –∏ –ø–æ—Ö–æ–∂–∏–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞)

## 1. –ë–∞–∑–æ–≤–∞—è –Ω–∞—Å—Ç—Ä–æ–π–∫–∞ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞

–≠—Ç–æ —Ñ—É–Ω–¥–∞–º–µ–Ω—Ç: –±–µ–∑ hostname, –ø–∞—Ä–æ–ª–µ–π –∏ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–æ–≤ ‚Äî –≤—Å—ë –æ—Å—Ç–∞–ª—å–Ω–æ–µ –Ω–µ –∏–º–µ–µ—Ç —Å–º—ã—Å–ª–∞.

### –ß—Ç–æ –¥–µ–ª–∞–µ–º:

1. –ó–∞–¥–∞—ë–º –∏–º—è (—á—Ç–æ–±—ã –≤ —Å–µ—Ç–∏ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –Ω–µ –ø—É—Ç–∞–ª–∏—Å—å).
2. –í–∫–ª—é—á–∞–µ–º –ø–∞—Ä–æ–ª–∏ –Ω–∞ –∫–æ–Ω—Å–æ–ª—å –∏ VTY (—É–¥–∞–ª—ë–Ω–Ω—ã–π –¥–æ—Å—Ç—É–ø).
3. –ù–∞—Å—Ç—Ä–∞–∏–≤–∞–µ–º –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã.

### –ü–æ—á–µ–º—É —Ç–∞–∫:

* `hostname` –Ω—É–∂–µ–Ω –¥–ª—è –≥–µ–Ω–µ—Ä–∞—Ü–∏–∏ –∫—Ä–∏–ø—Ç–æ–∫–ª—é—á–µ–π –∏ –¥–ª—è —É–¥–æ–±—Å—Ç–≤–∞.
* –ë–µ–∑ `enable secret` –ª—é–±–æ–π —Å–º–æ–∂–µ—Ç –∑–∞–π—Ç–∏ –≤ **privileged mode**.
* IP –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–µ –¥–µ–ª–∞–µ—Ç —Ä–æ—É—Ç–µ—Ä –¥–æ—Å—Ç—É–ø–Ω—ã–º –ø–æ —Å–µ—Ç–∏.

### –ö–æ–º–∞–Ω–¥—ã:

```bash
R1(config)#hostname R1
R1(config)#enable secret mysecret

R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#exit

R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 192.168.10.1 255.255.255.0
R1(config-if)#no shutdown
```

### –ü—Ä–æ–≤–µ—Ä–∫–∞:

```
R1#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.1    YES manual up                    up
```

---

## 2. –ù–∞—Å—Ç—Ä–æ–π–∫–∞ —É–¥–∞–ª—ë–Ω–Ω–æ–≥–æ –¥–æ—Å—Ç—É–ø–∞ (Telnet –∏ SSH)

### –ü–æ—á–µ–º—É:

* Telnet = –ø—Ä–æ—Å—Ç–æ–π —Å–ø–æ—Å–æ–± —É–¥–∞–ª—ë–Ω–Ω–æ–≥–æ –≤—Ö–æ–¥–∞, –Ω–æ **–ø–∞—Ä–æ–ª—å –ø–µ—Ä–µ–¥–∞—ë—Ç—Å—è –≤ –æ—Ç–∫—Ä—ã—Ç–æ–º –≤–∏–¥–µ**.
* SSH = —Ç–æ –∂–µ —Å–∞–º–æ–µ, –Ω–æ —Å **—à–∏—Ñ—Ä–æ–≤–∞–Ω–∏–µ–º**. –í —Ä–µ–∞–ª—å–Ω–æ–π —Å–µ—Ç–∏ –≤—Å–µ–≥–¥–∞ –∏—Å–ø–æ–ª—å–∑—É–µ–º SSH.

### Telnet (–±–∞–∑–æ–≤—ã–π –≤–∞—Ä–∏–∞–Ω—Ç):

```bash
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
R1(config-line)#transport input telnet
```

üëâ –¢–µ–ø–µ—Ä—å –º–æ–∂–Ω–æ –ø–æ–¥–∫–ª—é—á–∞—Ç—å—Å—è:

```
R2#telnet 192.168.10.1
Trying 192.168.10.1 ... Open
Password:
```

### SSH (—Ä–µ–∫–æ–º–µ–Ω–¥—É–µ—Ç—Å—è):

```bash
R1(config)#ip domain-name lab.local
R1(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024

R1(config)#username admin privilege 15 secret admin123
R1(config)#line vty 0 4
R1(config-line)#login local
R1(config-line)#transport input ssh
R1(config)#ip ssh version 2
```

–ü—Ä–æ–≤–µ—Ä–∫–∞:

```
R2#ssh -l admin 192.168.10.1
Password:
R1>
```

## 3. –ù–∞—Å—Ç—Ä–æ–π–∫–∞ —Å—Ç–∞—Ç–∏—á–µ—Å–∫–æ–π –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏

### –ü–æ—á–µ–º—É:

* –†–æ—É—Ç–µ—Ä –∑–Ω–∞–µ—Ç —Ç–æ–ª—å–∫–æ —Å–µ—Ç–∏, –ø–æ–¥–∫–ª—é—á–µ–Ω–Ω—ã–µ –∫ –µ–≥–æ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞–º.
* –ß—Ç–æ–±—ã —Å–≤—è–∑–∞—Ç—å —Ä–∞–∑–Ω—ã–µ –ø–æ–¥—Å–µ—Ç–∏, –Ω—É–∂–Ω–æ —Å–∫–∞–∑–∞—Ç—å: "–¥–ª—è —ç—Ç–æ–π —Å–µ—Ç–∏ –∏–¥–∏ —Ç—É–¥–∞".

### –ö–æ–º–∞–Ω–¥—ã:

```bash
R1(config)#ip route 192.168.20.0 255.255.255.0 192.168.10.2
```

–ó–Ω–∞—á–∏—Ç: —á—Ç–æ–±—ã –¥–æ–π—Ç–∏ –¥–æ —Å–µ—Ç–∏ `192.168.20.0/24`, –æ—Ç–ø—Ä–∞–≤–ª—è–π –ø–∞–∫–µ—Ç—ã –Ω–∞ —Å–æ—Å–µ–¥–Ω–∏–π —Ä–æ—É—Ç–µ—Ä `192.168.10.2`.

### –ü—Ä–æ–≤–µ—Ä–∫–∞:

```
R1#show ip route
S    192.168.20.0/24 [1/0] via 192.168.10.2
```

## 4. –ù–∞—Å—Ç—Ä–æ–π–∫–∞ –¥–∏–Ω–∞–º–∏—á–µ—Å–∫–æ–π –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏ (RIP, OSPF, EIGRP)

### –ü–æ—á–µ–º—É:

* –í –±–æ–ª—å—à–∏—Ö —Å–µ—Ç—è—Ö –≤—Ä—É—á–Ω—É—é –≤–≤–æ–¥–∏—Ç—å –º–∞—Ä—à—Ä—É—Ç—ã –Ω–µ—É–¥–æ–±–Ω–æ.
* –ü—Ä–æ—Ç–æ–∫–æ–ª—ã –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏ —Å–∞–º–∏ –æ–±–º–µ–Ω–∏–≤–∞—é—Ç—Å—è —Ç–∞–±–ª–∏—Ü–∞–º–∏.

### RIP (–ø—Ä–æ—Å—Ç–æ–π –ø—Ä–æ—Ç–æ–∫–æ–ª):

```bash
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#network 192.168.10.0
R1(config-router)#network 192.168.20.0
```

### OSPF (—Å–æ–≤—Ä–µ–º–µ–Ω–Ω—ã–π –≤–∞—Ä–∏–∞–Ω—Ç):

```bash
R1(config)#router ospf 1
R1(config-router)#network 192.168.10.0 0.0.0.255 area 0
R1(config-router)#network 192.168.20.0 0.0.0.255 area 0
```

## 5. NAT (–º–∞—Å–∫–∞—Ä–∞–¥–∏–Ω–≥)

### –ü–æ—á–µ–º—É:

* –í–Ω—É—Ç—Ä–µ–Ω–Ω–∏–µ IP-–∞–¥—Ä–µ—Å–∞ (192.168.x.x) –Ω–µ –≤–∏–¥–Ω—ã –≤ –∏–Ω—Ç–µ—Ä–Ω–µ—Ç–µ.
* NAT "–ø–æ–¥–º–µ–Ω—è–µ—Ç" –∏—Ö –Ω–∞ –ø—É–±–ª–∏—á–Ω—ã–π IP —Ä–æ—É—Ç–µ—Ä–∞.

### –ö–æ–º–∞–Ω–¥—ã:

```bash
R1(config)#interface FastEthernet0/0
R1(config-if)#ip nat inside
R1(config)#interface Serial0/0
R1(config-if)#ip nat outside

R1(config)#access-list 1 permit 192.168.10.0 0.0.0.255
R1(config)#ip nat inside source list 1 interface Serial0/0 overload
```

## 6. DHCP-—Å–µ—Ä–≤–µ—Ä –Ω–∞ Cisco

### –ü–æ—á–µ–º—É:

* –ß—Ç–æ–±—ã –ü–ö –≤ —Å–µ—Ç–∏ –∞–≤—Ç–æ–º–∞—Ç–∏—á–µ—Å–∫–∏ –ø–æ–ª—É—á–∞–ª–∏ IP, –º–∞—Å–∫—É, —à–ª—é–∑.

### –ö–æ–º–∞–Ω–¥—ã:

```bash
R1(config)#ip dhcp pool LAN
R1(dhcp-config)#network 192.168.10.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.10.1
R1(dhcp-config)#dns-server 8.8.8.8
```

## 7. ACL (–¥–æ—Å—Ç—É–ø –∏ —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—è)

### –ü–æ—á–µ–º—É:

* ACL = —Ñ–∏–ª—å—Ç—Ä, –∫–æ—Ç–æ—Ä—ã–π –≥–æ–≤–æ—Ä–∏—Ç, –∫–∞–∫–∏–µ –ø–∞–∫–µ—Ç—ã –ø—Ä–æ–ø—É—Å–∫–∞—Ç—å –∏–ª–∏ –±–ª–æ–∫–∏—Ä–æ–≤–∞—Ç—å.

### –ü—Ä–∏–º–µ—Ä: –∑–∞–ø—Ä–µ—Ç–∏—Ç—å ping –æ—Ç 192.168.10.5

```bash
R1(config)#access-list 100 deny icmp host 192.168.10.5 any
R1(config)#access-list 100 permit ip any any
R1(config)#interface FastEthernet0/0
R1(config-if)#ip access-group 100 in
```

## 8. SNMP, HTTP, —Å–µ—Ä–≤–∏—Å—ã (L7)

### –ü–æ—á–µ–º—É:

* –ò–Ω–æ–≥–¥–∞ –Ω—É–∂–Ω–æ –º–æ–Ω–∏—Ç–æ—Ä–∏—Ç—å —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –∏–ª–∏ –≤–∫–ª—é—á–∏—Ç—å –≤–µ–±-–¥–æ—Å—Ç—É–ø.

### –í–∫–ª—é—á–µ–Ω–∏–µ HTTP:

```bash
R1(config)#ip http server
```

##  –ò—Ç–æ–≥–æ–≤–∞—è –ª–æ–≥–∏–∫–∞

1. **L1‚ÄìL2 (—Ñ–∏–∑–∏–∫–∞/–∫–∞–Ω–∞–ª):** —Å–º–æ—Ç—Ä–∏—à—å –ª–∏–Ω–∫ (up/up) –∏ ARP.
2. **L3 (—Å–µ—Ç—å):** –¥–∞—ë—à—å IP, –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏—é.
3. **L4 (—Ç—Ä–∞–Ω—Å–ø–æ—Ä—Ç):** –ø—Ä–æ–≤–µ—Ä—è–µ—à—å Telnet/SSH.
4. **L5‚ÄìL6 (—Å–µ—Å—Å–∏–∏/—à–∏—Ñ—Ä–æ–≤–∞–Ω–∏–µ):** —Ä–∞–±–æ—Ç–∞ Telnet vs SSH.
5. **L7 (–ø—Ä–∏–ª–æ–∂–µ–Ω–∏—è):** HTTP, SNMP, FTP –∏ —Ç.–¥.