[
  "obsidian-tracker",
  "homepage",
  "obsidian-banners",
  "vimium",
  "omnisearch",
  "obsidian-excalidraw-plugin",
  "mermaid-tools",
  "obsidian-plantuml",
  "obsidian-kanban",
  "obsidian-charts",
  "dataview",
  "templater-obsidian"
]